app/Http/Controllers/Teacher/AbsensiController.php

    public function schedules()
    {
        $schedules = Auth::user()->schedules()->with(['subject', 'xclass'])
            ->where('user_id', auth()->id())
            ->orderByRaw("FIELD(day, 'MONDAY','TUESDAY','WEDNESDAY','THURSDAY','FRIDAY','SATURDAY','SUNDAY')")
            ->orderBy('start_time')
            ->get();
---
select * from `schedules` where `schedules`.`user_id` = 3 and `schedules`.`user_id` is not null and `user_id` = 3 order by FIELD(day, 'MONDAY','TUESDAY','WEDNESDAY','THURSDAY','FRIDAY','SATURDAY','SUNDAY'), `start_time` asc
select * from `subjects` where `subjects`.`id` in (1)
select * from `xclasses` where `xclasses`.`id` in (1)