app/Http/Controllers/AttendanceController.php

    public function show(Request $request)
    {
        $validated = $request->validate([
            'class_id'    => 'required|integer',
            'schedule_id' => 'required|integer',
            'date'        => 'required|date',
        ]);

        $date = Carbon::parse($validated['date'])->startOfDay();

        $class = Xclass::select('id', 'name')
            ->with(['students' => function ($q) {
                $q->select('students.id', 'students.xclass_id', 'students.name', 'students.nis')
                ->orderBy('students.name');
            }])
            ->findOrFail($validated['class_id']);

        $schedule = Schedule::select('id', 'subject_id')
            ->with('subject:id,name')
            ->findOrFail($validated['schedule_id']);

        // Get existing attendances for this class, schedule, and date
        $existingAttendances = Attendance::query()
            ->where('xclass_id', $class->id)
            ->where('schedule_id', $schedule->id)
            ->where('date', $date->toDateString())
            ->get(['student_id', 'status'])
            ->keyBy('student_id');
---
select `id`, `name` from `xclasses` where `xclasses`.`id` = '1' limit 1
select `students`.`id`, `students`.`xclass_id`, `students`.`name`, `students`.`nis` from `students` where `students`.`xclass_id` in (1) order by `students`.`name` asc
select `id`, `name` from `subjects` where `subjects`.`id` in (1)
select `id`, `subject_id` from `schedules` where `schedules`.`id` = '1' limit 1
select `student_id`, `status` from `attendances` where `xclass_id` = 1 and `schedule_id` = 1 and `date` = '2026-08-23'

    public function store(Request $request)
    {
        $request->validate([
            'class_id' => 'required|exists:xclasses,id',
            'schedule_id' => 'required|exists:schedules,id',
            'date' => 'required|date',
            'attendances' => 'required|array',
            'attendances.*.student_id' => 'required|exists:students,id',
            'attendances.*.status' => 'required|in:HADIR,IZIN,SAKIT,ALPHA',
        ]);

        $classId = $request->class_id;
        $scheduleId = $request->schedule_id;
        $date = Carbon::parse($request->date);

        foreach ($request->attendances as $attendanceData) {
            Attendance::updateOrCreate(
                [
                    'student_id' => $attendanceData['student_id'],
                    'xclass_id' => $classId,
                    'schedule_id' => $scheduleId,
                    'date' => $date,
                ],
                [
                    'status' => $attendanceData['status'],
                ]
            );
---
insert into `attendances` (`student_id`, `xclass_id`, `schedule_id`, `date`, `user_id`, `status`, `updated_at`, `created_at`) values ('81', '1', '1', '2026-08-23 00:00:00', 3, 'ALPHA', '2026-08-23 22:59:50', '2026-08-23 22:59:50')